class MyMessage:
       text_start = "<b>AIST NEWS готов к работе!</b> ✉️\n\n" + \
       "Сейчас, для успешного использования бота далее, выбери из каких ресурсов, вы хотите фильтровать и получать новости? \n\n" + \
       "<b>/help</b> → У тебя возникли некоторые вопросы? Не переживай! Отправляй команду и получай подробную информацию о боте🧡"
       text_telegram_chanel_news = "Отправь в чат <b>ссылку</b> или <b>id</b> телеграмм канала, от которого хочешь получать новости!</b> 📨\n\n"+ \
           "<i>Возможен выбор нескольких критериев</i>\n"
       text_news_change = "<b>Выберите за какими новостями хотите следить:</b> \n\n" + \
              "  <b>1.</b> Россия\n" + \
              "  <b>2.</b> Мир\n" + \
              "  <b>3.</b> Спорт\n" + \
              "  <b>4.</b> Экономика\n\n" + \
              "<i>Возможен выбор нескольких критериев</i>\n"
       text_website_news = "<b>Выберите интернет ресурсы за которыми желаете следить:</b> \n\n" + \
              "<i>Описание ресурсов:</i>\n" + \
              "  <b>1.</b> Сайт 1 - описание\n" + \
              "  <b>2.</b> Сайт 2 - описание\n" + \
              "  <b>3.</b> Сайт 3 - описание\n" + \
              "  <b>4.</b> Сайт 4 - описание\n\n" + \
              "<i>Возможен выбор нескольких критериев</i>\n"
       text_help = "<b>Подрбоная информация</b> 🤖️\n\n" + \
           "<i>Инструкция пользователя:</i>\n" + \
           "  <b>1.</b> Выберите нужное настроение \n" + \
           "  <b>2.</b> Выберите нужную категорию \n" + \
           "  <b>3.</b> Выберите откуда вы хотите извлекать новости и какие именно источники. \n" + \
           "  <b>4.</b> Наслаждайтесь пролистыванием новостей. \n\n" + \
           "<i>Техническая сторона проекта:</i>\n" + \
           "  <b>1.</b> Рекуррентные нейронные сети \n" + \
           "  <b>2.</b> Трансформеры \n" + \
           "  <b>3.</b> Использование обработчика/сборщика информаций с интернет ресурсов/telegram каналов \n\n" + \
           "<i>Бизнес решения проекта:</i>\n" + \
           "  <b>1.</b> Личный маскот \n" + \
           "  <b>2.</b> Возможность интеграций\n\n" + \
           "<i>Состав команды:</i>\n" + \
           "  <b>1.</b> Кашин Максим Игоревич \n" + \
           "  <b>2.</b> Жимолостнова Анна Васильевна \n" + \
           "  <b>3.</b> Поздняков Алексей Владимирович \n" + \
           "  <b>4.</b> Кузнецова Мария Павловна\n" + \
           "  <b>5.</b> Глушко Алиса Алексеевна \n" + \
           "  <b>6.</b> Разживин Александр Сергеевич\n" + \
           "  <b>7.</b> Калистратова Светлана Вячеславовна \n" + \
           "  <b>8.</b> Зюзин Сергей Александрович\n\n" + \
           "Узнал все, что хотел? Тогда пиши в чат → <b>/start</b> и узнавай что то новенькое🧡"